Revit 2027 API
BuiltInFailures.GeneralFailures.ErrorInFamilyResolved Property
 An error occurred in family "[Name]" and was automatically resolved. Please review changes made to the family.\nError Information:\n"[Text]"\nError Resolution: [Resolution]
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ErrorInFamilyResolved { get; }
Public Shared ReadOnly Property ErrorInFamilyResolved As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ErrorInFamilyResolved {
	FailureDefinitionId^ get ();
}
static member ErrorInFamilyResolved : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GeneralFailures Class
Autodesk.Revit.DB Namespace